# GenerateInstanceFromTemplate Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..GenerateInstanceFromTemplate Method
PanelScheduleView Class See Also
---
Assigns the data from the template to the instance and performs any tasks specific to the instance (3rd phase, borders, etc)
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void GenerateInstanceFromTemplate(
	ElementId templateId
)
```

Visual Basic
---
```text
Public Sub GenerateInstanceFromTemplate ( _
	templateId As ElementId _
)
```

Visual C++
---
```text
public:
void GenerateInstanceFromTemplate(
	ElementId^ templateId
)
```

# ### Parameters
templateId
    Type: Autodesk.Revit.DB..::..ElementId Element id of the template element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace